Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 450, 450, 16)      1216      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 90, 90, 16)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 86, 86, 32)        12832     
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 82, 82, 64)        51264     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 78, 78, 128)       204928    
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 74, 74, 256)       819456    
_________________________________________________________________
flatten (Flatten)            (None, 1401856)           0         
_________________________________________________________________
dense (Dense)                (None, 42)                58877994  
=================================================================
Total params: 59,967,690
Trainable params: 59,967,690
Non-trainable params: 0
_________________________________________________________________
