Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 450, 450, 16)      1216      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 90, 90, 16)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 86, 86, 32)        12832     
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 82, 82, 64)        51264     
_________________________________________________________________
flatten (Flatten)            (None, 430336)            0         
_________________________________________________________________
dense (Dense)                (None, 42)                18074154  
=================================================================
Total params: 18,139,466
Trainable params: 18,139,466
Non-trainable params: 0
_________________________________________________________________
