Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 450, 450, 16)      1216      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 45, 45, 16)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 41, 41, 32)        12832     
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 37, 37, 64)        51264     
_________________________________________________________________
flatten (Flatten)            (None, 87616)             0         
_________________________________________________________________
dense (Dense)                (None, 512)               44859904  
_________________________________________________________________
dense_1 (Dense)              (None, 42)                21546     
=================================================================
Total params: 44,946,762
Trainable params: 44,946,762
Non-trainable params: 0
_________________________________________________________________
