Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 40, 40, 8)         224       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 38, 38, 16)        1168      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 36, 36, 32)        4640      
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 34, 34, 64)        18496     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 32, 32, 128)       73856     
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 30, 30, 256)       295168    
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 1, 1, 42)          9676842   
_________________________________________________________________
reshape (Reshape)            (None, 2, 21)             0         
=================================================================
Total params: 10,070,394
Trainable params: 10,070,394
Non-trainable params: 0
_________________________________________________________________
